ep-load-test/tests/dial-out-payload-example.yml
# PSTN dial-out via Chime SMA (Dynamo-gated DTMF only).
#
# Prerequisites:
#   1. Pre-register analysts → data/analysts-payload.csv (attendeeId, pin, email, meetingId).
#   2. Required env (do not commit secrets):
#        export LOAD_TEST_SMA_ID=sma-xxxxxxxx
#        export LOAD_TEST_FROM_PHONE=+14155551234
#        export LOAD_TEST_TO_PHONE=+14155559999
#        export DIALOUT_PARTICIPANTS_TABLE_NAME=events-streaming-serverless-conference-participants-dev
#        export PRODUCTION_SMA_ID=sma-prod-xxxxxxxx   # optional guard
#   Optional: DIALOUT_POLL_TIMEOUT_MS, DIALOUT_POLL_INTERVAL_MS — see README.
#   Correlation SIP header, Dynamo GSI/attr, call-connection strings, and hand_raised / call_connection_state are fixed in code (config.js) to match events-streaming.
#
#   3. Run from ep-load-test:
#        npx artillery run tests/dial-out-payload-example.yml
#
# Flow (see scenario below):
#   dialParticipant → waitForMeetingIdPrompt → enterMeetingId →
#   waitForPinPrompt → enterPin
# After connected, optional *0 (human intake): sendHumanIntake → waitAfterHumanIntake — uncomment below if needed.
# Toggle hand: toggleHand (*1#) → waitForHandUp or waitForHandDown (polls hand_raised, not call_connection_state).
# Full cycle example: toggleHand → waitForHandUp → toggleHand → waitForHandDown.
# Then: think → hangUp (UpdateSipMediaApplicationCall with loadTestHangup; SMA returns Hangup)
# → waitForDisconnected (poll DISCONNECTED, same pattern as events-streaming).
#
# duration × arrivalRate ≤ CSV rows
#
# Failures: Artillery HTTP engine ignores done(err) on - function: steps; hooks emit('error', msg)
# on the scenario emitter so aggregate "errors" and ensure.maxErrorRate: 0 work. Later hooks
# no-op after a failure (__dialOutScenarioAborted) to avoid extra Chime/Dynamo calls.

config:
  target: "https://attendees.dev.events.q4inc.com/rest/v1"
  ensure:
    maxErrorRate: 0
  phases:
    - duration: 30 # !!! IMPORTANT: duration × arrivalRate must match CSV rows
      arrivalRate: 1
      name: "Dial out analysts at 1 call/sec"
  payload:
    path: "../data/analysts-payload.csv"
    fields:
      - "attendeeId"
      - "pin"
      - "email"
      - "meetingId"
    order: sequence
  processor: "../hooks/dialOutProcessor.js"

scenarios:
  - name: "Dial out one analyst via Chime SMA (Dynamo-gated)"
    flow:
      - function: dialParticipant
      - log: "Dialed out attendeeId={{ attendeeId }} meetingId={{ meetingId }}"
      - function: waitForMeetingIdPrompt
      - function: enterMeetingId
      - function: waitForPinPrompt
      - function: enterPin
      - function: waitForConnected
      - think: 60
      - function: toggleHand
      - function: waitForHandUp
      - think: 60
      - function: toggleHand
      - function: waitForHandDown
      # Optional *0 (expects INITIATE_TRANSFER_FROM_CHIME_TO_SUPPORT when LEG_B connected; see config.js if you need TRANSFERRING_TO_SUPPORT):
      # - function: sendHumanIntake
      # - function: waitAfterHumanIntake
      - think: 120
      - function: hangUp
      - function: waitForDisconnected
      - function: hangUpOnError # no-op on success; hangs up any live call left open by an earlier error